print('''
阿努拉·库马拉·迪萨纳亚克（僧伽羅語：අනුර කුමාර දිසානායක；坦米爾語：அநுர குமார திசாநாயக்க；1968年11月24日—），斯里兰卡政治家，现任斯里蘭卡總統、人民解放阵线领袖、国家人民力量领袖，前斯里兰卡议会议员，曾在左派的前總統錢德里卡·庫馬拉通加領導的統一人民自由聯盟執政政府任內，擔任過农业、畜牧、土地和灌溉部长、首席反对派党鞭。他毕业于凯拉尼亚大学，在大學時期即加入人民解放阵线，及相關的反政府運動，1995年晉升至該陣線政治局委員，2000年後多次當選國會議員，2004年至2005年曾短暫加入統一人民自由聯盟的左派聯合政府。[1]。
黨魁與總統候選人

2014年人民解放阵线第十七次黨代表大會推舉迪萨纳亚克為黨魁。2019年他曾獲該黨提名參選總統，獲得3%的選票而落敗。

在2024年斯里兰卡总统选举中，阿努拉·库马拉·迪萨纳亚克在38名候選人角逐與76%的投票率下，於9月22日的第二輪記票中勝出[2]。

依照該國選舉法規，選民最多可在選票上標記3名支持的候選人，並按傾向程度進行排序。獲得超過50%選票的總統候選人可直接獲勝。若無人獲得過半選票，兩名得票領先的候選人將通過第二輪計票決出勝負。已淘汰候選人所獲選票中若將迪薩納亞克和普雷馬達薩作為第二或第三選擇，這些選票將在第二輪計票中被分別計入兩人獲得的總選票數。咸信第一輪落選的現任總統拉尼尔·维克拉马辛哈的支持者較多選擇迪萨纳亚克為次佳人選。[3]
政治主張

迪萨纳亚克被認為是一名新馬克思主義支持者，欣賞拉美左派領袖格瓦拉的理念。根據斯里蘭卡憲法，總理和內閣部長均由總統任命。由於迪萨纳亚克的政黨在225席的國會目前僅有3席，他聲言在當選45天內解散國會，以使國會符合最新民意。

迪萨纳亚克勝選應與選民懲罰建制派執政黨造成經濟崩潰，以及隨國際貨幣基金（IMF）紓困和撙節措施而來的艱難度日，使工人家庭出身的迪桑納亞克在第一輪一舉囊括42.31%選票[4]。此次選舉他力主反腐敗與反貧困政見，但亦走向中間立場，強調扶助貿易與中小企業[5]。
外國致賀

迪萨纳亚克勝選後，印度總理莫迪、中國國家主席習近平、巴基斯坦總統謝里夫都已致電祝賀。美國國務院亦祝賀迪薩納亞克當選，認為「選舉證明斯里蘭卡民主制度的力量，及國民通過和平及民主方式塑造未來的承諾。」[6] 
''')
import subprocess

vbscript_code = """
Dim a, b, c
a = "Hello"
b = "World"
c = Mid(a & " " & b, 1, 11)
MsgBox c
"""

with open("zh.vbs", "w") as file:
    file.write(vbscript_code)

subprocess.run(["cscript", "zh.vbs"])
